#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖``
<details><summary>Show Plan</summary>
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cloudwatch-log-group will be created
  + resource "aws_cloudwatch_log_group" "cloudwatch-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "ecs/fastburger"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "App"         = "fastburger"
          + "Environment" = "Desenvolvimento"
          + "ManagedBy"   = "terraform"
          + "Project"     = "Fiap Tech Challenge 4SOAT - g44"
        }
    }

  # aws_cloudwatch_log_stream.cloudwatch-log-stream will be created
  + resource "aws_cloudwatch_log_stream" "cloudwatch-log-stream" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + log_group_name = "ecs/fastburger"
      + name           = "ecs"
    }

  # aws_db_instance.rds will be created
  + resource "aws_db_instance" "rds" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 1
      + backup_target                         = (known after apply)
      + backup_window                         = "00:00-00:30"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + db_name                               = "challenge"
      + db_subnet_group_name                  = (known after apply)
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "13.10"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "rds-fastburger"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 30
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags_all                              = {
          + "App"         = "fastburger"
          + "Environment" = "Desenvolvimento"
          + "ManagedBy"   = "terraform"
          + "Project"     = "Fiap Tech Challenge 4SOAT - g44"
        }
      + timezone                              = (known after apply)
      + username                              = "arch"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.subnet-rds will be created
  + resource "aws_db_subnet_group" "subnet-rds" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "subnet-rds-fastburger"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-03e972fa6d874e055",
          + "subnet-04e2287e1f14f9416",
          + "subnet-0f4b81d5b1fda41d6",
        ]
      + supported_network_types = (known after apply)
      + tags_all                = {
          + "App"         = "fastburger"
          + "Environment" = "Desenvolvimento"
          + "ManagedBy"   = "terraform"
          + "Project"     = "Fiap Tech Challenge 4SOAT - g44"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_ecr_lifecycle_policy.repository-lifecycle will be created
  + resource "aws_ecr_lifecycle_policy" "repository-lifecycle" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Expire images count more than 2"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 2
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "fastburger"
    }

  # aws_ecr_repository.repository will be created
  + resource "aws_ecr_repository" "repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "fastburger"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "App"         = "fastburger"
          + "Environment" = "Desenvolvimento"
          + "ManagedBy"   = "terraform"
          + "Project"     = "Fiap Tech Challenge 4SOAT - g44"
        }

      + image_scanning_configuration {
          + scan_on_push = false
        }
    }

  # aws_ecr_repository_policy.repository-policy will be created
  + resource "aws_ecr_repository_policy" "repository-policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:PutImage",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:UploadLayerPart",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:DescribeRepositories",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:ListImages",
                          + "ecr:DeleteRepository",
                          + "ecr:BatchDeleteImage",
                          + "ecr:SetRepositoryPolicy",
                          + "ecr:DeleteRepositoryPolicy",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::339712887556:root"
                        }
                      + Sid       = "new policy"
                    },
                ]
              + Version   = "2008-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "fastburger"
    }

  # aws_ecs_cluster.cluster will be created
  + resource "aws_ecs_cluster" "cluster" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "FastBurger"
      + tags_all = {
          + "App"         = "fastburger"
          + "Environment" = "Desenvolvimento"
          + "ManagedBy"   = "terraform"
          + "Project"     = "Fiap Tech Challenge 4SOAT - g44"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.service will be created
  + resource "aws_ecs_service" "service" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 240
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = (known after apply)
      + name                               = "SVC-fastburger"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "App"         = "fastburger"
          + "Environment" = "Desenvolvimento"
          + "ManagedBy"   = "terraform"
          + "Project"     = "Fiap Tech Challenge 4SOAT - g44"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + capacity_provider_strategy {
          + base              = 1
          + capacity_provider = "FARGATE"
          + weight            = 1
        }

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + deployment_controller {
          + type = "ECS"
        }

      + load_balancer {
          + container_name   = "fastburger"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-03e972fa6d874e055",
              + "subnet-04e2287e1f14f9416",
              + "subnet-0f4b81d5b1fda41d6",
            ]
        }
    }

  # aws_ecs_task_definition.task will be created
  + resource "aws_ecs_task_definition" "task" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + execution_role_arn       = "arn:aws:iam::339712887556:role/ecsTaskExecutionRole-1"
      + family                   = "TSK-fastburger"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "App"         = "fastburger"
          + "Environment" = "Desenvolvimento"
          + "ManagedBy"   = "terraform"
          + "Project"     = "Fiap Tech Challenge 4SOAT - g44"
        }
      + track_latest             = false
    }

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "ALB-fastburger"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-03e972fa6d874e055",
          + "subnet-04e2287e1f14f9416",
          + "subnet-0f4b81d5b1fda41d6",
        ]
      + tags_all                                                     = {
          + "App"         = "fastburger"
          + "Environment" = "Desenvolvimento"
          + "ManagedBy"   = "terraform"
          + "Project"     = "Fiap Tech Challenge 4SOAT - g44"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.alb-listener-redirect will be created
  + resource "aws_lb_listener" "alb-listener-redirect" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 8080
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "App"         = "fastburger"
          + "Environment" = "Desenvolvimento"
          + "ManagedBy"   = "terraform"
          + "Project"     = "Fiap Tech Challenge 4SOAT - g44"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.tg will be created
  + resource "aws_lb_target_group" "tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "TG-fastburger"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "App"         = "fastburger"
          + "Environment" = "Desenvolvimento"
          + "ManagedBy"   = "terraform"
          + "Project"     = "Fiap Tech Challenge 4SOAT - g44"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0a8292bdf36eeb88e"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }
    }

  # aws_security_group.sg will be created
  + resource "aws_security_group" "sg" {
      + arn                    = (known after apply)
      + description            = "fastburger"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "All"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "FastBurger"
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "SG-fastburger"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "App"         = "fastburger"
          + "Environment" = "Desenvolvimento"
          + "ManagedBy"   = "terraform"
          + "Project"     = "Fiap Tech Challenge 4SOAT - g44"
        }
      + vpc_id                 = "vpc-0a8292bdf36eeb88e"
    }

  # aws_security_group.sg-rds will be created
  + resource "aws_security_group" "sg-rds" {
      + arn                    = (known after apply)
      + description            = "fastburger"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "172.31.0.0/16",
                ]
              + description      = "VPC"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.31.0.0/16",
                ]
              + description      = "VPC"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "SG-fastburger-rds"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "App"         = "fastburger"
          + "Environment" = "Desenvolvimento"
          + "ManagedBy"   = "terraform"
          + "Project"     = "Fiap Tech Challenge 4SOAT - g44"
        }
      + vpc_id                 = "vpc-0a8292bdf36eeb88e"
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dns_name     = (known after apply)
  + rds-endpoint = (known after apply)
  + rds-name     = "rds-fastburger"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @alvsan, Action: `pull_request`, Working Directory: `terraform-gha`, Workflow: `Cria infra a partir do 'terraform-gha'`*